[
  {
    "id": "siemens.com",
    "name": "Siemens",
    "description": "Siemens is the main contractor for the Euro-Asia Interconnector, an Israel-EU submarine electricity cable that is planned to connect Israel’s illegal settlements in the occupied Palestinian territory to Europe. Siemens-branded electrical appliances are sold globally."
  },
  {
    "id": "puma.com",
    "name": "PUMA",
    "description": "Puma sponsors the Israel Football Association, which governs teams in Israel’s illegal settlements on occupied Palestinian land."
  },
  {
    "id": "carrefour.com",
    "name": "Carrefour",
    "description": "Carrefour is a genocide enabler. Carrefour-Israel has supported Israeli soldiers partaking in the unfolding genocide of Palestinians in Gaza with gifts of personal packages. In 2022, it entered a partnership with the Israeli company Electra Consumer Products and its subsidiary Yenot Bitan, both of which are involved in grave violations against the Palestinian people."
  },
  {
    "id": "axa.com",
    "name": "AXA",
    "description": "When Russia invaded Ukraine, AXA took targeted measures against it. Yet, as Israel, a 75-year-old regime of settler-colonialism and apartheid, wages a genocidal war on Gaza, AXA continues to invest in Israeli banks financing war crimes and the theft of Palestinian land and natural resources."
  },
  {
    "id": "hp.com",
    "name": "Hewlett Packard Inc (HP Inc)",
    "description": "HP Inc provides services to the offices of genocide leaders, Israeli PM Netanyahu and Financial Minister Smotrich."
  },
  {
    "id": "ahava.com",
    "name": "Ahava",
    "description": "Ahava cosmetics has its production site, visitor center, and main store in an illegal Israeli settlement in the occupied Palestinian territory."
  },
  {
    "id": "sodastream.com",
    "name": "SodaStream",
    "description": "SodaStream is actively complicit in Israel's policy of displacing the indigenous Bedouin-Palestinian citizens of Israel in the Naqab (Negev) and has a long history of racial discrimination against Palestinian workers."
  },
  {
    "id": "elbitsystems.com",
    "name": "Elbit Systems",
    "description": "Elbit Systems, apartheid Israel’s largest arms company and “field-tests” its weapons on Palestinians, including in Israel’s ongoing genocidal war on Palestinins in Gaza. On top of building killer drones, Elbit makes surveillance technology for Israel's apartheid wall, checkpoints and Gaza fence, enabling apartheid. The US and EU use Elbit's tech to militarize their borders, violating refugee and indigenous peoples' rights."
  },
  {
    "id": "hd-hyundai.com",
    "name": "HD Hyundai",
    "description": "Machinery from HD Hyundai, Vovlo, CAT, and JCB has been used by Israel in the ethnic cleansing and forced displacement of the Palestinian people through the destruction of Palestinian homes, farms, and businesses, as well as the construction of illegal settlements, a war crime under international law."
  },
  {
    "id": "volvo.com",
    "name": "Volvo",
    "description": "Machinery from HD Hyundai, Vovlo, CAT, and JCB has been used by Israel in the ethnic cleansing and forced displacement of the Palestinian people through the destruction of Palestinian homes, farms, and businesses, as well as the construction of illegal settlements, a war crime under international law."
  },
  {
    "id": "caterpillar.com",
    "name": "CAT",
    "description": "Machinery from HD Hyundai, Vovlo, CAT, and JCB has been used by Israel in the ethnic cleansing and forced displacement of the Palestinian people through the destruction of Palestinian homes, farms, and businesses, as well as the construction of illegal settlements, a war crime under international law."
  },
  {
    "id": "jcb.com",
    "name": "JCB",
    "description": "Machinery from HD Hyundai, Vovlo, CAT, and JCB has been used by Israel in the ethnic cleansing and forced displacement of the Palestinian people through the destruction of Palestinian homes, farms, and businesses, as well as the construction of illegal settlements, a war crime under international law."
  },
  {
    "id": "google.com",
    "name": "Google",
    "description": "As the Israeli military bombed homes, clinics, and schools in Gaza and threatened to push Palestinian families from their homes in occupied Jerusalem May 2021, Amazon Web Services and Google Cloud executives signed a $1.22 billion contract to provide cloud technology to the Israeli government and military. By supporting Israeli apartheid with vital technologies, Amazon and Google are directly implicated in its entire system of oppression, including its unfolding genocide in Gaza. Join the #NoTechForApartheid campaign."
  },
  {
    "id": "amazon.com\n\naws.amazon.com",
    "name": "Amazon",
    "description": "As the Israeli military bombed homes, clinics, and schools in Gaza and threatened to push Palestinian families from their homes in occupied Jerusalem May 2021, Amazon Web Services and Google Cloud executives signed a $1.22 billion contract to provide cloud technology to the Israeli government and military. By supporting Israeli apartheid with vital technologies, Amazon and Google are directly implicated in its entire system of oppression, including its unfolding genocide in Gaza. Join the #NoTechForApartheid campaign."
  },
  {
    "id": "airbnb.com",
    "name": "Airbnb",
    "description": "Airbnb, Booking.com and Expedia all offer rentals in illegal Israeli settlements built on stolen Palestinian land."
  },
  {
    "id": "booking.com",
    "name": "Booking",
    "description": "Airbnb, Booking.com and Expedia all offer rentals in illegal Israeli settlements built on stolen Palestinian land."
  },
  {
    "id": "expedia.com",
    "name": "Expedia",
    "description": "Airbnb, Booking.com and Expedia all offer rentals in illegal Israeli settlements built on stolen Palestinian land."
  },
  {
    "id": "remax.com",
    "name": "RE/MAX",
    "description": "The company markets and sells property in illegal Israeli settlements built on stolen Palestinian land, thus enabling Israel’s colonization of the occupied West Bank."
  },
  {
    "id": "home.barclays",
    "name": "Barclays Bank",
    "description": "Barclays Bank (UK) holds more than £1 billion in shares and provides more than £3bn in loans and underwriting to nine companies whose weapons, components and military technology have been used in Israel’s armed violence against Palestinians."
  },
  {
    "id": "caf.net",
    "name": "CAF",
    "description": "Basque transport firm, CAF, builds and services the Jerusalem Light Rail (JLR), a tram line that serves Israel's illegal settlements in Jerusalem. CAF benefits from Israel’s war crimes on stolen Palestinian land."
  },
  {
    "id": "chevron.com",
    "name": "Chevron",
    "description": "US fossil fuel multinational Chevron is the main international corporation extracting gas claimed by apartheid Israel in the East Mediterranean. Chevron generates billions in revenues, strengthening Israel’s war chest. Chevron fuels Israeli apartheid and the climate crisis."
  },
  {
    "id": "hikvision.com",
    "name": "HikVision",
    "description": "Amnesty International has documented high-resolution CCTV cameras made by the Chinese company Hikvision installed in residential areas and mounted to Israeli military infrastructure for surveillance of Palestinians. Some of these models, according to Hikvision’s own marketing, can plug into external facial recognition software."
  },
  {
    "id": "tkhsecurity.com",
    "name": "TKH Security",
    "description": "Amnesty International has identified cameras made by the Dutch company TKH Security used by Israel for surveillance of Palestinians. TKH provides Israeli police with surveillance technology that is used to entrench apartheid."
  },
  {
    "id": "mcdonalds.com",
    "name": "McDonald's",
    "description": "Is now being targeted by grassroots organic boycott campaigns, not initiated by the BDS movement, because these companies, or their branches or franchises in Israel, have openly supported Israel and/or provided generous in-kind donations to the Israeli military amid the current Israeli offensive against 2.3 million Palestinians in the occupied and besieged Gaza Strip–described by leading international scholars of international law as an “unfolding genocide.”"
  },
  {
    "id": "bk.com",
    "name": "Burger King",
    "description": "Is now being targeted by grassroots organic boycott campaigns, not initiated by the BDS movement, because these companies, or their branches or franchises in Israel, have openly supported Israel and/or provided generous in-kind donations to the Israeli military amid the current Israeli offensive against 2.3 million Palestinians in the occupied and besieged Gaza Strip–described by leading international scholars of international law as an “unfolding genocide.”"
  },
  {
    "id": "papajohns.com",
    "name": "Papa John's",
    "description": "Is now being targeted by grassroots organic boycott campaigns, not initiated by the BDS movement, because these companies, or their branches or franchises in Israel, have openly supported Israel and/or provided generous in-kind donations to the Israeli military amid the current Israeli offensive against 2.3 million Palestinians in the occupied and besieged Gaza Strip–described by leading international scholars of international law as an “unfolding genocide.”"
  },
  {
    "id": "pizzahut.com",
    "name": "Pizza Hut",
    "description": "Is now being targeted by grassroots organic boycott campaigns, not initiated by the BDS movement, because these companies, or their branches or franchises in Israel, have openly supported Israel and/or provided generous in-kind donations to the Israeli military amid the current Israeli offensive against 2.3 million Palestinians in the occupied and besieged Gaza Strip–described by leading international scholars of international law as an “unfolding genocide.”"
  },
  {
    "id": "wix.com",
    "name": "Wix",
    "description": "Is now being targeted by grassroots organic boycott campaigns, not initiated by the BDS movement, because these companies, or their branches or franchises in Israel, have openly supported Israel and/or provided generous in-kind donations to the Israeli military amid the current Israeli offensive against 2.3 million Palestinians in the occupied and besieged Gaza Strip–described by leading international scholars of international law as an “unfolding genocide.”"
  },
  {
    "id": "fiverr.com",
    "name": "Fiverr",
    "description": "Fiverr is an Israeli multinational online marketplace for freelance services"
  },
  {
    "id": "loreal.com",
    "name": "L'oreal",
    "description": "L'oreal has established israel as its commercial center in the middle east and has increased investment and manufacturing activities. \n\nThey also own: Lancôme, Urban Decay, Biotherm, Giorgio Armani, Laroche, Posay, Biotherm, Garnier, Ralph Lauren, Ysl, Mugler, Dove, Valentino, Vichy Cosmetics, Diesel, Maybelline, Azzaro, Kerastase, Prada, Youth To The People, Nyx, Max Factor, Essie, Cerave, Kiehls, Wella, Redken, It Cosmetics, Pureology, Matrix."
  },
  {
    "id": "nestle.com",
    "name": "Nestlè",
    "description": "Nestlè owns 54% of the leading israeli food manufacturer in osem. They temporarily shut down a production plant in Israel.\n\nThey also own: Maggi, Nescafè, Kit Kat, Nespresso, Purina, Carnation, Nesquik, Aero, Cheerios, Coffee Mate, Nestea, Smarties, Quality Street, Haagen Daaz, Milkybar."
  },
  {
    "id": "coca-cola.com",
    "name": "Coca Cola",
    "description": "Coca Cola’s branches in Israel own dairy farms in illegal Israeli settlements.\n\nThey also own: Appletiser, Aquarius, Dasani, Costa Coffee (Since 2019), Fanta, Fairlife, Dogadan, Fresca, Fuzetea, Minute Maid, Powerade, Schwepps, Smart Water, Sprite, Vitamin Water, Innocent Smoothies"
  }
]